Ben Kahan  
DS210  
3 October 2022  
Homework 3  
Collaborators: None

# Question 1

In [16]:
import numpy as np
import pandas as pd

In [6]:
A = np.random.randint(20, size=100)
A

array([17,  6,  4, 11, 17, 15, 11, 19, 15,  4,  9,  4, 19, 17, 14,  3, 18,
        3,  2,  0, 13, 13,  4, 12,  2,  7,  4, 19, 18, 10,  4,  8, 13, 14,
       14, 10, 15,  4, 11, 11, 14, 16,  2, 18,  5, 18, 15,  2,  8, 13, 16,
       19,  2,  2, 12, 19, 12,  5,  8,  4,  0,  6,  2, 11, 13,  8,  5,  6,
       14, 16, 10, 16,  2,  0, 16, 19, 19, 16,  6, 17, 10, 19, 12,  3, 19,
       19, 12,  1,  5, 10,  5,  5,  0, 13, 10,  3,  2, 16, 17, 17])

In [11]:
sample_size_t = 10
B = np.random.choice(A, size=sample_size_t, replace=False)
B

array([ 4,  4, 10,  5,  4, 15, 12,  6,  4, 14])

In [15]:
cars = ["Tesla Model 3", "Toyota Prius", "Lucid Air", "Porsche 918", "Audi RS4", 
        "Honda Accord", "Madza 3", "Subaru WRX", "Mercedes S550", "Subaru BRZ", "Audi Q7", "Alfa Romeo Giulia", 
        "Mini Cooper", "Fiat 500", "Infiniti G35X", "Nissan 370Z", "BMW M3", "Cybertruck"]

In [85]:
selectedCars = np.random.choice(cars, size=sample_size_t, replace=False)
selectedCars

array(['Subaru WRX', 'Alfa Romeo Giulia', 'Audi RS4', 'Cybertruck',
       'BMW M3', 'Lucid Air', 'Subaru BRZ', 'Audi Q7', 'Infiniti G35X',
       'Toyota Prius'], dtype='<U17')

In [96]:
mpg = np.random.randint(5,50, size=(1,sample_size_t))
mpg = mpg[0]

In [103]:
secTo60 = np.random.randint(1,20, size=(1,sample_size_t))
secTo60 = secTo60[0]

In [110]:
df1 = pd.DataFrame({'Car Name':np.random.choice(cars, size=sample_size_t, replace=False), 'MPG':mpg})
df1

            Car Name  MPG
0            Audi Q7   26
1      Tesla Model 3   28
2  Alfa Romeo Giulia   34
3         Cybertruck   38
4       Toyota Prius   31
5            Madza 3   49
6        Porsche 918   40
7      Infiniti G35X   15
8        Mini Cooper   39
9             BMW M3   30

In [148]:
df2 = pd.DataFrame({'Car Name':selectedCars, '0 to 60':secTo60})
df2

            Car Name  0 to 60
0         Subaru WRX       12
1  Alfa Romeo Giulia       14
2           Audi RS4       12
3         Cybertruck       14
4             BMW M3        1
5          Lucid Air        9
6         Subaru BRZ        7
7            Audi Q7       10
8      Infiniti G35X       16
9       Toyota Prius       19

In [205]:
df3 = pd.merge(df1, df2, how="outer")
df3

             Car Name   MPG  0 to 60
0             Audi Q7  26.0     10.0
1       Tesla Model 3  28.0      NaN
2   Alfa Romeo Giulia  34.0     14.0
3          Cybertruck  38.0     14.0
4        Toyota Prius  31.0     19.0
5             Madza 3  49.0      NaN
6         Porsche 918  40.0      NaN
7       Infiniti G35X  15.0     16.0
8         Mini Cooper  39.0      NaN
9              BMW M3  30.0      1.0
10         Subaru WRX   NaN     12.0
11           Audi RS4   NaN     12.0
12          Lucid Air   NaN      9.0
13         Subaru BRZ   NaN      7.0

In [206]:
avgMPG = df3['MPG'].sum()/len(df3['MPG'])

In [207]:
df3['MPG'] = df3['MPG'].fillna(avgMPG)

In [208]:
df3

             Car Name        MPG  0 to 60
0             Audi Q7  26.000000     10.0
1       Tesla Model 3  28.000000      NaN
2   Alfa Romeo Giulia  34.000000     14.0
3          Cybertruck  38.000000     14.0
4        Toyota Prius  31.000000     19.0
5             Madza 3  49.000000      NaN
6         Porsche 918  40.000000      NaN
7       Infiniti G35X  15.000000     16.0
8         Mini Cooper  39.000000      NaN
9              BMW M3  30.000000      1.0
10         Subaru WRX  23.571429     12.0
11           Audi RS4  23.571429     12.0
12          Lucid Air  23.571429      9.0
13         Subaru BRZ  23.571429      7.0

In [209]:
maxSpeed = df3['0 to 60'].max()
maxSpeed

19.0

In [210]:
df3['0 to 60'] = df3['0 to 60'].fillna(maxSpeed)
df3

             Car Name        MPG  0 to 60
0             Audi Q7  26.000000     10.0
1       Tesla Model 3  28.000000     19.0
2   Alfa Romeo Giulia  34.000000     14.0
3          Cybertruck  38.000000     14.0
4        Toyota Prius  31.000000     19.0
5             Madza 3  49.000000     19.0
6         Porsche 918  40.000000     19.0
7       Infiniti G35X  15.000000     16.0
8         Mini Cooper  39.000000     19.0
9              BMW M3  30.000000      1.0
10         Subaru WRX  23.571429     12.0
11           Audi RS4  23.571429     12.0
12          Lucid Air  23.571429      9.0
13         Subaru BRZ  23.571429      7.0

In [218]:
tmp = df3.iloc[:, 0]
for x in range(len(tmp)):
    tmp[x]

0               Audi Q7
1         Tesla Model 3
2     Alfa Romeo Giulia
3            Cybertruck
4          Toyota Prius
5               Madza 3
6           Porsche 918
7         Infiniti G35X
8           Mini Cooper
9                BMW M3
10           Subaru WRX
11             Audi RS4
12            Lucid Air
13           Subaru BRZ
Name: Car Name, dtype: object

In [212]:
df_eco = df3.loc[df3['MPG'] > avgMPG]

In [213]:
df_eco

            Car Name   MPG  0 to 60
0            Audi Q7  26.0     10.0
1      Tesla Model 3  28.0     19.0
2  Alfa Romeo Giulia  34.0     14.0
3         Cybertruck  38.0     14.0
4       Toyota Prius  31.0     19.0
5            Madza 3  49.0     19.0
6        Porsche 918  40.0     19.0
8        Mini Cooper  39.0     19.0
9             BMW M3  30.0      1.0